{
  "10": {
    "Chủ đề: Động học chất điểm": {
      "chapter": "CƠ HỌC",
      "content": "Nghiên cứu về chuyển động của vật mà không xét đến nguyên nhân gây ra chuyển động. Bao gồm các khái niệm về độ dịch chuyển, vận tốc, gia tốc. Các dạng chuyển động: thẳng đều, thẳng biến đổi đều, rơi tự do, chuyển động tròn đều.",
      "objectives": [
        "Phân biệt được độ dịch chuyển và quãng đường đi được, tốc độ và vận tốc.",
        "Viết được phương trình chuyển động, vẽ được đồ thị của chuyển động thẳng đều và thẳng biến đổi đều.",
        "Vận dụng được các công thức của rơi tự do để giải bài toán.",
        "Mô tả được các đại lượng đặc trưng của chuyển động tròn đều."
      ],
      "common_exercises": [
        "Tính quãng đường, vận tốc, gia tốc trong chuyển động thẳng biến đổi đều.",
        "Bài toán về hai xe gặp nhau.",
        "Tính thời gian rơi và vận tốc chạm đất của vật rơi tự do.",
        "Tính tốc độ góc, tốc độ dài, gia tốc hướng tâm."
      ]
    },
    "Chủ đề: Động lực học chất điểm": {
      "chapter": "CƠ HỌC",
      "content": "Nghiên cứu về mối liên hệ giữa chuyển động của vật và các lực tác dụng lên nó. Bao gồm ba định luật Newton, các loại lực cơ học (hấp dẫn, đàn hồi, ma sát), và các định luật bảo toàn (động lượng, năng lượng).",
      "objectives": [
        "Phát biểu và vận dụng được ba định luật Newton.",
        "Phân tích được các lực tác dụng lên vật.",
        "Vận dụng được định luật bảo toàn động lượng và năng lượng để giải các bài toán va chạm.",
        "Hiểu và áp dụng được công thức tính công và công suất."
      ],
      "common_exercises": [
        "Bài toán phân tích lực trên mặt phẳng nghiêng.",
        "Bài toán va chạm mềm và va chạm đàn hồi.",
        "Tính công của một lực và công suất."
      ]
    }
  },
  "11": {
    "Chủ đề: Điện tích - Điện trường": {
      "chapter": "ĐIỆN HỌC - ĐIỆN TỪ HỌC",
      "content": "Nghiên cứu về các điện tích đứng yên và tương tác giữa chúng. Bao gồm định luật Coulomb, khái niệm điện trường, cường độ điện trường, điện thế, hiệu điện thế, và tụ điện.",
      "objectives": [
        "Phát biểu và áp dụng định luật Coulomb để tính lực tương tác giữa hai điện tích điểm.",
        "Mô tả được khái niệm điện trường và các đặc trưng của nó.",
        "Tính được công của lực điện và hiệu điện thế.",
        "Hiểu được cấu tạo, chức năng và cách ghép tụ điện."
      ],
      "common_exercises": [
        "Tính lực điện tổng hợp tác dụng lên một điện tích.",
        "Xác định cường độ điện trường tại một điểm.",
        "Bài toán về chuyển động của điện tích trong điện trường đều.",
        "Tính điện dung tương đương của bộ tụ điện."
      ]
    },
    "Chủ đề: Dòng điện không đổi": {
      "chapter": "ĐIỆN HỌC - ĐIỆN TỪ HỌC",
      "content": "Nghiên cứu về dòng điện có chiều và cường độ không đổi theo thời gian. Bao gồm các khái niệm về cường độ dòng điện, điện trở, suất điện động. Định luật Ohm cho toàn mạch, các định luật Kirchhoff, công và công suất của dòng điện.",
      "objectives": [
        "Phát biểu và vận dụng được định luật Ohm cho đoạn mạch và toàn mạch.",
        "Vận dụng được các phương pháp giải mạch điện.",
        "Tính được công và công suất tiêu thụ điện của một đoạn mạch."
      ],
      "common_exercises": [
        "Giải mạch điện hỗn hợp gồm các điện trở.",
        "Bài toán tìm suất điện động và điện trở trong của nguồn điện.",
        "Tính nhiệt lượng toả ra trên một điện trở."
      ]
    }
  },
  "12": {
    "Chủ đề: Dao động cơ": {
      "chapter": "DAO ĐỘNG VÀ SÓNG CƠ HỌC",
      "content": "Khảo sát chuyển động qua lại quanh một vị trí cân bằng của vật. Bao gồm dao động điều hoà, con lắc lò xo, con lắc đơn, dao động tắt dần, dao động cưỡng bức và hiện tượng cộng hưởng.",
      "objectives": [
        "Viết được phương trình dao động điều hoà và xác định các đại lượng đặc trưng (biên độ, tần số góc, pha ban đầu).",
        "Hiểu được mối liên hệ giữa dao động điều hoà và chuyển động tròn đều.",
        "Vận dụng được các công thức tính chu kì, tần số của con lắc lò xo và con lắc đơn.",
        "Giải thích được các hiện tượng dao động tắt dần, cưỡng bức và cộng hưởng."
      ],
      "common_exercises": [
        "Viết phương trình dao động từ các điều kiện ban đầu.",
        "Bài toán về năng lượng trong dao động điều hoà.",
        "Tổng hợp hai dao động điều hoà cùng phương, cùng tần số."
      ]
    },
    "Chủ đề: Sóng cơ và sóng âm": {
      "chapter": "DAO ĐỘNG VÀ SÓNG CƠ HỌC",
      "content": "Nghiên cứu sự lan truyền của dao động cơ trong một môi trường. Bao gồm các khái niệm về sóng ngang, sóng dọc, các đặc trưng của sóng. Các hiện tượng giao thoa, sóng dừng. Sóng âm và các đặc trưng của âm.",
      "objectives": [
        "Mô tả được sự truyền sóng và các đại lượng đặc trưng của sóng (bước sóng, chu kì, tần số, tốc độ truyền sóng).",
        "Viết được phương trình sóng.",
        "Giải thích và vận dụng được điều kiện giao thoa, sóng dừng.",
        "Phân biệt được các đặc trưng vật lí và sinh lí của âm."
      ],
      "common_exercises": [
        "Tính bước sóng, tốc độ truyền sóng.",
        "Bài toán giao thoa sóng trên mặt nước.",
        "Xác định vị trí các bụng sóng, nút sóng trong hiện tượng sóng dừng."
      ]
    }
  }
}
